[
  {
    "title": "Food Process",
    "location": "Carole Park, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Food Process & Machine Operator – Carole Park(Brisbane)\n\nWhat’s the gig?\nWe’re Recruit Masters, the blue-collar specialists who know our way around a production line as well as you do. Right now, our food-manufacturing clients (think household names) need switched-on operators to keep the lines humming.\n\nDay to day\n* Setting up, running and tweaking high-speed processing & packing machinery\n* Handling raw meat on halal-certified lines \n* Quality checks that’d make your mum proud – temp, weight, seals, the works\n* Cleaning & sanitising gear so the food-safety auditors stay happy\n* Teaming up with crew and supervisors to smash shift targets safely\n\nShift options\n✅Day shifts: $30.68 - kick-off between 4 am – 7 am\n✅Arvo shifts:$34.36 - start around 1:30 pm\n✅Lock in a regular roster – be reliable \n\nYou’ll fit right in if you…\n✅Have previous food-processing or machine-operating experience (bonus points for both)\n✅Can lift up to \\~20 kg and stay on your feet all shift\n✅Understand HACCP/GMP basics – or are keen to learn fast\n✅Can pass a pre-employment medical, drug & alcohol test and reference checks\n✅Bring great attitude, solid work ethic, and zero drama – simple!\n\nWhy jump on board?\n* Steady hours with overtime when production peaks\n* Work with industry-leading brands (looks good on the résume)\n* Supportive supervisors, and genuine pathways to permanent hire \n* Weekly pay and occasional overtime!\n\nSound like your next move?\nApply Now or contact us directly to secure your spot.\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment.\nAll qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\n\nRecruit Masters – we’ve worn the hi-vis, now we hire the hi-vis.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/84866562?type=standard&ref=search-standalone&origin=cardTitle#sol=606bc8c3cc162fec8a8c22d0938fabfbe97b42fa"
  }
]