[
  {
    "title": "Forklift Operator",
    "location": "Richlands, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "We’re Hiring: High Reach Forklift Operators | Richlands \nDay Shift | Start ASAP | Ongoing Work\n\nJoin a nationally recognised company that’s growing like crazy! We’re on the lookout for skilled High Reach Forklift Operators to jump into an awesome team based at a state-of-the-art facility in Richlands.\n\n Shift: Monday to Friday, 5:30am – 1:36pm\n PPE Required: Hi-vis (vest or polo), steel caps – standard safety gear\n\n ✅ What You’ll Need:\n- Current Forklift Licence\n- At least 12 months' experience on High Reach (Jungheinrich or Yale experience is a bonus!)\n- A good team vibe – you'll be working closely with others\n\n✅ What You’ll Be Doing:\n- Driving High Reach Forklifts (Jungheinrich & Yale)\n- Picking and packing orders\n- Loading containers for dispatch\n- Working hand-in-hand with the Manufacturing team\n- Being part of a tight-knit crew of 8\n\n✅ Perks of the Job:\n- Work in a modern, purpose-built warehouse\n- Easy location in Richlands with plenty of free onsite parking\n- Break room with free coffee machine, food vending machines & big screen TVs\n- Designated smokers area\n\nWe’re screening now – don’t wait!\nReach out for a confidential chat and lock in your next opportunity.\n\n\n#SCR-apelu-vitale",
    "url": "https://www.seek.com.au/job/84460646?type=standard&ref=search-standalone&origin=cardTitle#sol=fce5124b38fb5c33c3b3c145f4cff420fc5a6913"
  },
  {
    "title": "Production Worker",
    "location": "Acacia Ridge, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Production Worker – Warehouse & Production | $31.60/hr | Acacia Ridge\n\nJoin a leading name in manufacturing and play a key role in keeping the supply chain moving.\nOur client is a well-established leader in the manufacturing and production industry, exporting high-quality agricultural products across Australia and New Zealand. They're currently seeking a reliable and energetic Production Worker to support operations across both the production floor and warehouse.\nThis is a casual position with regular ongoing shifts, offering $31.60 per hour, located in Acacia Ridge, with the potential to grow your career in a thriving industry.\n\nWhat You’ll Be Doing:\nHands-on work across production and warehouse functions\nPicking, packing, and preparing goods for export\nOperating within a fast-paced environment where accuracy and efficiency matter\nMaintaining quality standards and following safety procedures\nWhat We’re Looking For:\nSolid experience in process or production work\nStrong attention to detail – quality matters\nA team player who’s proactive and dependable\nComfortable adapting to shifting priorities and tasks\nPhysically fit and ready to roll up your sleeves\nBonus Points If You Have:\nPrevious experience in manufacturing, warehouse, or similar environments\nA can-do attitude and eagerness to learn\nA track record of reliability and initiative\nWhy You’ll Love It:\nBe part of a collaborative, close-knit team\nLearn the ropes of a major industry player\nGet paid well for your hard work\nBuild real experience that could lead to more down the track\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment. All qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\nDon’t miss your chance to step into a rewarding role with real impact.\nApply Now or contact us directly to secure your spot.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/84230311?type=standard&ref=search-standalone&origin=cardTitle#sol=8088898f08d1e71eb7376c248c996db91f05dd83"
  },
  {
    "title": "Storeperson",
    "location": "Bohle, Northern QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "$37.65 per hour",
    "summary": "We're looking for a dedicated Storeperson to join our team at a leading steel manufacturer and supplier of metal flooring and safety barriers.\nAre you detail-oriented with strong organisation skills and a valid forklift license?\nRegular set hours Mon - Friday 7am - 3.00pm\n \nKey Responsibilities:\n\nEfficiently manage the storage and movement of materials within the warehouse.\nOperate forklifts safely to load, unload, and transport steel products.\nMaintain accurate inventory records and perform regular stock checks.\nCollaborate with team members to ensure smooth warehouse operations.\nAdhere to safety protocols and maintain a clean work environment.\n \nRequirements:\n\nValid forklift license with Counter Balance experience. \nPrevious experience in a warehouse or manufacturing environment is preferred.\nStrong attention to detail and organisational skills.\nAbility to work independently and as part of a team.\nCommitment to workplace safety and efficiency.\nExperience with overhead cranes is preferred but not essential.\n \nWhy Join Us?\n\nBe part of a dynamic team in a growing industry.\nSupportive work environment that values safety and teamwork.\nWell above award wages\nView to permanency for right candidate\n \nIf you're ready to take the next step in your career and work with a company that values integrity, safety, and community, apply today!\n \nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment. All qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.",
    "url": "https://www.seek.com.au/job/83994296?type=standard&ref=search-standalone&origin=cardTitle#sol=b08691fec632d482c8163a040428810da969b101"
  }
]