[
  {
    "title": "Receiving",
    "location": "Richlands, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "About the role\nJoin a leading manufacturing company based in Richlands, known for quality products and a strong team culture. We’re on the lookout for a motivated individual to join our receiving team as a Receiving Officer - Entry level opportunity (manufacturing).  No experience? No worries – full training provided for the right person! \n\nHours can be either :  6am – 2pm or 7am – 3pm (Monday to Friday)  \n\n \n\nWhat you'll be doing\n- Assist with receiving and checking incoming deliveries  \n- Support unloading of goods and basic stock handling  \n- Learn to accurately match stock with purchase orders and delivery dockets  \n- Use Fishbowl Inventory software (training provided)  \n- Communicate effectively via Microsoft Outlook \n- Keep the receiving area clean, organised, and safe  \n- Follow site safety procedures and work well with the team  \n\n \n\nWhat We’re Looking For\n- Eagerness to learn and a can-do attitude  \n- Strong attention to detail and willingness to follow processes  \n- Comfortable with physical work and manual handling  \n- Good communication skills and basic computer knowledge  \n- Forklift licence is a bonus – but not essential! Willingness to obtain is enough  \n- Experience with Outlook or Fishbowl is a plus, but full training is provided  \n\n \n\nWhat we offer\n\n- Great entry-level opportunity into manufacturing and warehousing  \n- Supportive team and hands-on training provided  \n- Early finishes and consistent weekday hours  \n- Long-term potential for the right person  \n- Free on-site parking  \n\n\nAbout us\n\nAt Recruit Masters', we are committed to providing a rewarding and supportive work environment for our employees. In addition to a competitive hourly rate, we offer a range of benefits including staff discounts, opportunities for career development, and a fun, collaborative team culture.\n\nStart your career in manufacturing today!\nIf you’re reliable, eager to learn, and ready to roll up your sleeves – we want to hear from you. Apply now!",
    "url": "https://www.seek.com.au/job/83034018?type=standard&ref=search-standalone&origin=cardTitle#sol=6aee1766372c3ec45e9990b3b612b8aa90a188f3"
  },
  {
    "title": "Picker/Packer",
    "location": "Acacia Ridge, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Full time",
    "pay": "Casual Full Time",
    "summary": "Pick Packer\n\nLocation: Acacia Ridge, Queensland\n\nHours: Monday to Friday, 8:00 AM – 4:00 PM (with occasional overtime on weekends)\n\nEmployment Type: Casual Full-time\n\nPosition Overview:\n\nWe are looking for a reliable and experienced Pick Packer to join our small warehouse team at a well-known company in Australia, based in Acacia Ridge. This role involves picking and packing cartons containing up to four 5-litre bottles. The successful candidate will have previous pick packing experience and be able to work efficiently, sometimes with overtime on weekends. PPE (Personal Protective Equipment) is mandatory.\n\nKey Responsibilities:\n\nPicking and packing products up to (4 x 5-litre bottles per carton) accurately and efficiently.\nEnsuring correct packing and sealing of cartons for shipment.\nAdhering to safety protocols and wearing required PPE at all times (e.g., safety boots and high-visibility vest).\nMaintaining a clean, organized, and safe work environment.\nMeeting daily targets for picking and packing.\nAssisting with additional warehouse tasks as needed.\nBeing available for occasional overtime on weekends as required by the business.\n\nRequirements:\n\nProven experience in a pick packing role or similar warehouse position.\nAbility to lift and move cartons containing 6 x 2-litre bottles.\nStrong attention to detail and accuracy in picking and packing orders.\nAbility to meet daily targets and manage time effectively.\nReliable and punctual with a strong work ethic.\nMust wear required PPE during shifts.\nAbility to work both independently and as part of a team.\n\nBenefits:\n\nMonday to Friday work schedule (with occasional overtime on weekends).\nCompetitive pay.\nWork for a well-known and reputable company in Australia.\nOpportunity for growth and career development within the company.\nFriendly and supportive team environment.\n\n\n\n\nReach out now for a confidential discussion - we are screening this week for an immediate start!\n\n#SCR-apelu-vitale\n\n\n",
    "url": "https://www.seek.com.au/job/82889338?type=standard&ref=search-standalone&origin=cardTitle#sol=fa3a0fc26af7dfde1dd9c29f5a9bca981a2e0eb5"
  },
  {
    "title": "Production with LF",
    "location": "Lytton, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Company Overview:\n\nWe are currently hiring new team members for our client, a leading kitchen cabinet manufacturer based in Lytton, Queensland, known for their top-quality craftsmanship.\n\nThe Opportunity:\n\nWe are looking for a skilled Cabinet Maker to join our team. If you're someone who enjoys working with your hands, takes pride in precision, and has experience with both machinery and hand tools, we want to hear from you! Additionally, the ideal candidate will need to have a forklift licence. This is a casual position with the potential to transition into a permanent role based on performance and business needs.\n\nKey Responsibilities:\n\nRead blueprints and technical drawings to create custom kitchen cabinets.\n• Use woodworking tools and machinery to cut, shape, and assemble wood with accuracy.\n• Operate production machinery to meet deadlines and ensure quality.\n• Apply finishes and install hardware to achieve top-tier results.\n• Maintain a clean and safe work environment.\n• Operate a forklift safely and efficiently as required.\nWhat We’re Looking For:\n\nPrevious experience as a Cabinet Maker or in a similar woodworking role.\n• Strong skills with hand tools and woodworking machinery.\n• Excellent attention to detail and a commitment to high-quality craftsmanship.\n• The ability to focus on tasks in a stationary position for extended periods.\n• A valid forklift licence and experience operating a forklift.\n• Ability to work efficiently in a fast-paced team setting.\n• Good communication skills and a positive attitude.\n• Candidates must undergo and pass a pre-employment drug and alcohol test before commencing employment.\nWhat We Offer:\n\nTraining to help you grow your skills and advance your career.\n• Opportunities to contribute your ideas and make a real impact.\n• A supportive team and competitive pay.\n• Casual payrate $34.33 per hour, Monday to Friday, 7:00 am - 3:16 pm, with the potential for permanent employment based on performance and business needs.\nHow to Join the Team:\nReady to elevate your career? Apply now and become part of our team to contribute to our continued success. We are committed to creating a diverse and inclusive workplace where everyone can thrive.\n\nDiversity Commitment:\nAt Recruit Masters, we value diversity and believe it drives innovation. All qualified candidates are encouraged to apply, and we provide equal opportunities throughout the recruitment process.\nOnly candidates selected for further consideration will be contacted.\n\n#SCR-apelu-vitale",
    "url": "https://www.seek.com.au/job/83359592?type=standard&ref=search-standalone&origin=cardTitle#sol=8ac7256047183a5eda73818ce50a5c45f7d14fd3"
  },
  {
    "title": "Storeperson",
    "location": "Bohle, Northern QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "We're looking for a dedicated Storeperson to join our team at a leading steel manufacturer and supplier of metal flooring and safety barriers.\nAre you a detail-oriented individual that works well in teams and hold a valid forklift license?\nRegular set hours Mon - Friday 7am - 3.06pm\n \nKey Responsibilities:\n\nEfficiently manage the storage and movement of materials within the warehouse.\nOperate forklifts safely to load, unload, and transport steel products.\nMaintain accurate inventory records and perform regular stock checks.\nCollaborate with team members to ensure smooth warehouse operations.\nAdhere to safety protocols and maintain a clean work environment.\n \nRequirements:\n\nValid forklift license with Counter Balance experience. Combi Lift exp would be advantageous!\nPrevious experience in a warehouse or manufacturing environment is preferred.\nStrong attention to detail and organisational skills.\nAbility to work independently and as part of a team.\nCommitment to workplace safety and efficiency.\nExperience with overhead cranes is preferred but not essential.\n \nWhy Join Us?\n\nBe part of a dynamic team in a growing industry.\nSupportive work environment that values safety and teamwork.\nWell above award wages\nView to permanency for right candidate\n \nIf you're ready to take the next step in your career and work with a company that values integrity, safety, and community, apply today!\n \nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment. All qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted by phone",
    "url": "https://www.seek.com.au/job/83168135?type=standard&ref=search-standalone&origin=cardTitle#sol=ebf1644c9b7d0a1c6f9776425e9d11e4741bb054"
  }
]