[
  {
    "title": "Food Process",
    "location": "Carole Park, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Food Process & Machine Operator – Carole Park(Brisbane)\n\nWhat’s the gig?\nWe’re Recruit Masters, the blue-collar specialists who know our way around a production line as well as you do. Right now, our food-manufacturing clients (think household names) need switched-on operators to keep the lines humming.\n\nDay to day\n* Setting up, running and tweaking high-speed processing & packing machinery\n* Handling raw meat on halal-certified lines \n* Quality checks that’d make your mum proud – temp, weight, seals, the works\n* Cleaning & sanitising gear so the food-safety auditors stay happy\n* Teaming up with crew and supervisors to smash shift targets safely\n\nShift options\n✅Day shifts: $30.68 - kick-off between 4 am – 7 am\n✅Arvo shifts:$34.36 - start around 1:30 pm\n✅Lock in a regular roster – be reliable \n\nYou’ll fit right in if you…\n✅Have previous food-processing or machine-operating experience (bonus points for both)\n✅Can lift up to \\~20 kg and stay on your feet all shift\n✅Understand HACCP/GMP basics – or are keen to learn fast\n✅Can pass a pre-employment medical, drug & alcohol test and reference checks\n✅Bring great attitude, solid work ethic, and zero drama – simple!\n\nWhy jump on board?\n* Steady hours with overtime when production peaks\n* Work with industry-leading brands (looks good on the résume)\n* Supportive supervisors, and genuine pathways to permanent hire \n* Weekly pay and occasional overtime!\n\nSound like your next move?\nApply Now or contact us directly to secure your spot.\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment.\nAll qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\n\nRecruit Masters – we’ve worn the hi-vis, now we hire the hi-vis.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/84866562?type=standard&ref=search-standalone&origin=cardTitle#sol=47ebba6019f2f8d083cde5a8c2cdfee7f519ba21"
  },
  {
    "title": "Packer with Forklift",
    "location": "Brisbane Airport, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "We are currently seeking a skilled and reliable Packer with Forklift licence to join our team in a cold storage environment. The successful candidate will play a key role in handling perishable food products, ensuring accurate and efficient movement, storage, and loading/unloading of goods.\n\nKey Responsibilities:\nOperate forklifts safely and efficiently in a chilled environment\n\nStack and unstack pallets with precision\nLoad and unload trucks as per delivery schedules\nBuild custom pallets to fit various items and orders\nMaintain cleanliness and safety standards in the work area\nFollow all company policies and cold room safety procedures\nRequirements:\n\nValid forklift license and proven experience\nPrevious experience working in cold storage or with perishable goods preferred\nAbility to build secure and stable pallets\nPhysically fit and able to work in a cold environment for extended periods\nAttention to detail and good organizational skills\nReliable and punctual with a strong work ethic",
    "url": "https://www.seek.com.au/job/84825722?type=standard&ref=search-standalone&origin=cardTitle#sol=228d3b685ec8e68712656bc9381ed961292d8db0"
  },
  {
    "title": "Workshop Mechanic",
    "location": "Wacol, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Heavy Truck & Trailer Mechanic – Brisbane\nReady to put your mechanical skills to work with a supportive team and a well-maintained fleet? Join us as a Heavy Truck & Trailer Mechanic and enjoy a secure, rewarding role that values your craftsmanship and attention to detail.\n \nThe Role:\nYou’ll be responsible for maintaining and repairing a fleet of prime movers and trailing equipment to the highest standards. Reporting to the Workshop Manager, your day-to-day will include:\n\nCompleting preventive maintenance and repairs on fleet vehicles with pride and care.\nFollowing Rentco service checklists and company policies.\nUsing your experience to support apprentices and foster a positive workshop culture.\nJumping in to assist with deliveries, housekeeping, and emergency breakdowns when needed.\nEnsuring a safe, clean, and professional workspace.\nWhat You’ll Bring:\n✅ HR License\n✅ Mechanical trade qualification\n✅ Proven experience in fleet & trailer maintenance\n✅ Familiarity with ABS/EBS diagnostic tools (advantageous)\n✅ A commitment to safe practices and a proactive attitude\n✅ Ability to pass a pre-employment medical and drug test\n \nPerks & Benefits:\n\nCompetitive rates and industry-standard penalties\nSecure, ongoing work with career growth opportunities\nModern workshop facilities and a well-maintained fleet\nAnnual incentive bonus of up to $3000\nSupportive team culture that values your input and expertise\nWant to learn more?\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment. All qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\nDon’t miss your chance to step into a rewarding role with real impact.\nApply Now or contact us directly to secure your spot.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/84738020?type=standard&ref=search-standalone&origin=cardTitle#sol=5c0f964d3319c70d9d78a0b335f2ea21544b7c82"
  }
]