[
  {
    "title": "Food Process",
    "location": "Carole Park, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Food Process & Machine Operator – Carole Park location\n\nWhat’s the gig?\nWe’re Recruit Masters, the blue-collar specialists who know our way around a production line as well as you do. Right now, our food-manufacturing clients (think household names) need switched-on operators to keep the lines humming across their Carole Park site.\n\nDay to day\n* Setting up, running and tweaking high-speed processing & packing machinery\n* Handling raw meat on halal-certified lines \n* Quality checks that’d make your mum proud – temp, weight, seals, the works\n* Cleaning & sanitising gear so the food-safety auditors stay happy\n* Teaming up with crew and supervisors to smash shift targets safely\n\nShift options\n✅Day shifts:kick-off anywhere between 4 am – 7 am\n✅Arvo shifts:start around 1:30 pm\n✅Lock in a regular roster – show us you’re reliable \n\nYou’ll fit right in if you…\n✅Have previous food-processing or machine-operating experience (bonus points for both)\n✅Can lift up to \\~20 kg and stay on your feet all shift\n✅Understand HACCP/GMP basics – or are keen to learn fast\n✅Can pass a pre-employment medical, drug & alcohol test and reference checks\n✅Bring great attitude, solid work ethic, and zero drama – simple!\n\nWhy jump on board?\n* Steady hours with overtime when production peaks\n* Work with industry-leading brands (looks good on the résumé)\n* Supportive supervisors, and genuine pathways to permanent hire \n* Weekly pay and occasional!\n\nSound like your next move?\nApply Now or contact us directly to secure your spot.\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment.\nAll qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\n\nRecruit Masters – we’ve worn the hi-vis, now we hire the hi-vis.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/85758187?type=standard&ref=search-standalone&origin=cardTitle#sol=5435514c3758f8c0a917f51a76e093cb0ea30d4e"
  },
  {
    "title": "HC Truck Driver",
    "location": "Wacol, Brisbane QLD",
    "date_posted": "Unknown",
    "job_type": "Casual/Vacation",
    "pay": "Not listed",
    "summary": "Our client  is seeking a talented and reliable HC Truck Driver to join their team based in Wacol. As a key member of the crew, you'll play a vital role in keeping operations running smoothly, ensuring their fleet of trucks are well-maintained and ready to hit the road.\nWhat You'll Bring to the Table:\n\nA passion and  commitment to safe, efficient driving practices\nA keen eye for detail and a proactive approach to yard work, moving trucks in and out of the wash bay and into their designated parking spots\nA flexible and adaptable mindset, ready to tackle a range of tasks, from minimal off-road work to nearby site visits\nPreferred Requirements:\nExtensive experience operating HC-class vehicles, with a strong understanding of their unique handling and performance characteristics\nExcellent communication skills, enabling you to collaborate effectively with our team and respond promptly to any requests or concerns\nA commitment to safety, with a clean driving record and the ability to follow all relevant regulations and protocols\nA solutions-oriented mindset, able to think on your feet and adapt to changing circumstances with ease\nA keen eye for detail and a proactive approach to maintaining the  organisation of our vehicle fleet\nPreferred Qualifications:\nA valid HC driver's license, with a proven track record of safe and responsible driving\nRelevant experience in the transportation and logistics industry, preferably in a similar role\nA strong understanding of vehicle maintenance and the ability to identify and address any issues that may arise\n\nSound like your next move?\nApply Now or contact us directly to secure your spot.\nRecruit Masters values diversity. We believe that a diverse and inclusive workforce fosters innovation and creativity, contributing to a positive and dynamic working environment.\nAll qualified candidates are welcome to apply, and we are committed to ensuring equal opportunities throughout our recruitment process.\n*Please note only shortlisted applicants will be contacted.\n\n\nRecruit Masters – we’ve worn the hi-vis, now we hire the hi-vis.\n\n#SCR-selena-vitale",
    "url": "https://www.seek.com.au/job/85760592?type=standard&ref=search-standalone&origin=cardTitle#sol=c8d401ae8a54e87bb716f3c2a8b2757ec0be446c"
  }
]